# -*- coding: UTF-8 -*-
Feature: 会議室情報一覧を表示する

  システム管理者の一人として、
  登録されている全ての会議室の情報を一覧表示したい。
  なぜなら、この画面から、各会議室の詳細情報を表示・編集したり、会議室情報を削除したりしたいからだ。

  @wip
  Scenario: 会議室情報が1件だけ登録されている
    Given ユーザは "管理者" としてログインしている
    And   システムの "スタートページ" が表示されている
    And   システムに "会議室A" が登録されている
    When  ユーザは "会議室一覧" リンクをクリックする
    Then  システムは "会議室一覧" ページを表示する
    And   ページに "会議室A" の情報が表示されている

  Scenario: 会議室情報が登録されていない
    Given ユーザは "管理者" としてログインしている
    And   システムの "スタートページ" が表示されている
    And   システムに会議室情報が登録されていない
    When  ユーザは "会議室一覧" リンクをクリックする
    Then  システムは "会議室一覧" ページを表示する
    And   ページに "会議室が登録されていません" というエラーが表示されている
